


Router(config)#hostname R1
R1(config)#line console 0
R1(config-line)#exec-timeout 0 0
R1(config-line)#logging synchronous
-------------PC1/192.168.1.1
R1(config)#interface gigabitEthernet 0/0
R1(config-if)#ip address 192.168.1.254 255.255.255.0
R1(config-if)#no shutdown

R1(config)#interface gigabitEthernet 0/1
R1(config-if)#ip address 192.168.2.254 255.255.255.0
R1(config-if)#no shutdown

------PC2/192.168.2.1
------pc3/192.168.2.2
SERVER>ping 192.168.2.2
SERVER>ping 192.168.2.1
SERVER>ping 192.168.1.1
  Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),

禁止 PC2 访问 PC1 ,允许其它主机pc3访问PC1
  使用标准acl限制pc2
              ##  使用标准acl  0  代表匹配，1 不匹配
    ##  使用标准acl  0  代表匹配，1 不匹配 [ 二进制 8个1 代表255=(1111 1111)2 ]
R1(config)#access-list 1 deny 192.168.2.1 0.0.0.0
或者使用
R1(config)#access-list 1 deny host 192.168.2.1

------PC2/192.168.2.1
------pc3/192.168.2.2
                        ##放行其他数据
R1(config)#access-list 1 permit any

R1(config)#interface gigabitEthernet 0/1
        #在接口中应用acl 阻止进入接口(in){出去out}
R1(config-if)#ip access-group 1 in


R1#show ?
  access-lists       List access lists
#查看访问控制列表
R1#show  access-lists
Standard IP access list 1
    10 deny host 192.168.2.1
    20 permit any

SERVER>ping 192.168.2.254
Ping statistics for 192.168.2.254:
    Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),
===================================
只允许主机PC2访问PC1,禁止所有其它访问
    #删除ACL设置====删除ACL
R1(config)#no access-list 1

R1#show  access-lists
  #标准访问控制列表的访问控制列表号{ 1 ~ 99 }
#基于源IP地址过滤数据包 
R1(config)#access-list 1 permit 192.168.2.1 0.0.0.0

R1(config)#access-list 1 permit host 192.168.2.1

R1#show access-lists
Standard IP access list 1
    10 permit host 192.168.2.1

#隐含拒绝语句：
#access-list  1  deny  0.0.0.0  255.255.255.255

#access-list  1  deny  0.0.0.0  255.255.255.255
或写为
#access-list  1  deny  any

全局指定主机：
access-list  1  deny  192.168.1.1  0.0.0.0
##全局指定网段：
access-list  1  permit  192.168.1.0  0.0.0.255

===================================
#、	删除已建立的访问控制列表
R1(config)#no access-list 1
R1#show access-lists

     #禁止主机2.1 访问主机1.1 的 ftp服务

  #扩展访问控制列表的访问控制列表号{ 100 ~ 199 }
#基于源IP地址、目的IP地址、指定协议、端口等来过滤数据包 

#access-list access-list-number {deny | permit} protocol 
{ source source-wildcard destination destination-wildcard} [operator operand]

   #禁止主机2.1 访问主机1.1 的 ftp[端口21] 服务
R1(config)#access-list 100 deny tcp 
host 192.168.2.1 host 192.168.1.1 eq 21


   #禁止主机2.2 访问主机1.1 的 http[端口80] www 服务
R1(config)#access-list 100 deny tcp 
host 192.168.2.2 host 192.168.1.1 eq 80 

  #允许其它   任意主机any 访问 任意主机any 的所有服务
R1(config)#access-list 100 permit ip any any

##在接口中应用acl
R1(config)#interface gigabitEthernet 0/1

#接口模式：ip  access-group  列表号 in或out
R1(config-if)#ip access-group 100 in

R1#show access-lists
Extended IP access list 100
    10 deny tcp host 192.168.2.1 host 192.168.1.1 eq ftp
    20 deny tcp host 192.168.2.2 host 192.168.1.1 eq www
    30 permit ip any any

###################测试ftp[21]服务
SERVER>ftp 192.168.1.1
Trying to connect...192.168.1.1
%Error opening ftp://192.168.1.1/ (Timed out)

SERVER>ftp 192.168.1.1
Trying to connect...192.168.1.1
Connected to 192.168.1.1
220- Welcome to PT Ftp server
Username:nsd
331- Username ok, need password
Password:
230- Logged in
===========================


##、	接口上取消ACL
接口模式：no  ip  access-group  列表号in 或out
R1(config)#interface gigabitEthernet 0/1

#  接口上取消ACL:# no  ip  access-group  列表号 in/out
R1(config-if)#no ip access-group 100 in

R1#show access-lists
Extended IP access list 100
    10 deny tcp host 192.168.2.1 host 192.168.1.1 eq ftp
    20 deny tcp host 192.168.2.2 host 192.168.1.1 eq www
    30 permit ip any any
SERVER>ping 192.168.1.1
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
===========================================================
==================  nat  =======================
-------NAT Network  Address Translation 网络地址转换----

##静态转换static translation
#端口多路复用{port address translation  PAT}


PC1/192.168.1.1---Fa0/2
PC2/192.168.1.2---Fa0/3
G0/0 /192.168.1.254
G0/1 /100.0.0.1
PC3/100.0.0.10

PC1 ----SW------R-----PC3
         |
       PC2
Switch(config)#hostname SW
SW(config)#line console 0
SW(config-line)#exec-timeout 0  0
SW(config-line)#logging synchronous

Router(config)#hostname R
R(config)#line console 0
R(config-line)#exec-timeout 0 0
R(config-line)#logging synchronous

R(config)#interface gigabitEthernet 0/1
R(config-if)#ip address 100.0.0.1 255.0.0.0
R(config-if)#no shutdown

R(config)#interface gigabitEthernet 0/0
R(config-if)#ip address 192.168.1.254 255.255.255.0
R(config-if)#no shutdown

=================@#配置静态nat转换
R(config)#ip nat inside source static 192.168.1.1 100.0.0.2
R(config)#ip nat inside source static 192.168.1.2 100.0.0.3

============#在内部和外部端口上启用NAT
R(config)#interface gigabitEthernet 0/0
==============入口配置：ip 　nat 　inside 
R(config-if)#ip nat inside 
R(config-if)#exit
R(config)#interface gigabitEthernet 0/1
============出口配置：ip 　nat 　outside
R(config-if)#ip nat outside

===================#	端口多路复用（PAT）
通过改变外出数据包的源IP地址和源端口并进行端口转换，
内部网络的所有主机均可共享一个合法IP地址实现互联网的访问，
节约IP。
PAT的配置：
全局：ip nat inside source list 1 interface f0/1 overload

在R1上配置端口映射
 192.168.1.1的80端口映射为100.0.0.2的80端口


R#show running-config 

interface GigabitEthernet0/0
 ip address 192.168.1.254 255.255.255.0
 ip nat inside
interface GigabitEthernet0/1
 ip address 100.0.0.1 255.0.0.0
 ip nat outside

ip nat inside source static 192.168.1.1 100.0.0.2 
ip nat inside source static 192.168.1.2 100.0.0.3 

R(config)#no ip nat inside source static 192.168.1.1 100.0.0.2
R(config)#no ip nat inside source static 192.168.1.2 100.0.0.3
===========192.168.1.1的80端口映射为100.0.0.2的80端口
R(config)#ip nat inside source static tcp 192.168.1.1 80 100.0.0.2 80

R#show running-config 
ip nat inside source static tcp 192.168.1.1 80 100.0.0.2 80 


R(config)#no ip nat inside source static tcp 192.168.1.1 80 100.0.0.2 80
=========端口多路复用（PAT）内部网络的所有主机均可共享一个合法IP地址
###使用acl定义内部ip地址
R(config)#access-list 1 permit 192.168.1.0 0.0.0.255

###使用pat复用外网接口地址
R(config)#ip nat inside source list 1 interface gigabitEthernet 0/1 overload 

开启nat排错功能
R#debug ip nat 
IP NAT debugging is on

S表示源地址source ip
D表示目的地址destination ip
192.168.1.2->61.159.62.130表示将192.168.1.2转换为61.159.62.130

关闭nat排错功能
R#undebug ip nat 
IP NAT debugging is off



=#端口多路复用（PAT）内部网络的所有主机均可共享一个合法IP地址
PC1/192.168.1.1---Fa0/2
PC2/192.168.1.2---Fa0/3
G0/0 /192.168.1.254
G0/1 /100.0.0.1
PC3/100.0.0.10

R1(config)#line console 0
R1(config-line)#exec-timeout 0 0
R1(config-line)#logging synchronous

R1(config)#interface gigabitEthernet 0/0
R1(config-if)#ip address 192.168.1.254 255.255.255.0
R1(config-if)#no shutdown

R1(config)#interface gigabitEthernet0/1
R1(config-if)#ip address 100.0.0.1 255.0.0.0
R1(config-if)#no shutdown

R1(config)#interface gigabitEthernet 0/0
R1(config-if)#ip nat inside
R1(config-if)#exit
R1(config)#interface gigabitEthernet 0/1
R1(config-if)#ip nat outside

R1(config)#access-list 1 permit 192.168.1.0 0.0.0.255
R1(config)#ip nat inside source list 1 interface gigabitEthernet 0/1 overload

R1#debug ip nat
IP NAT debugging is on

SERVER>ping 100.0.0.10
Ping statistics for 100.0.0.10:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
====================================================================



====================================================================
STP  Spanning Tree Protocol生成树协议
网桥BID值最小的交换机 是网络中的根网桥
默认值32768 
网桥优先级取值范围0 ~ 65535

Switch(config)#hostname SW1
SW1(config)#line console 0
SW1(config-line)#exec-timeout 0  0
SW1(config-line)#logging synchronous
SW1(config-line)#exit

SW1(config)#spanning-tree vlan 1 priority 0001

% Bridge Priority must be in increments of 4096.
% Allowed values are:
  0     4096  8192  12288 16384 20480 24576 28672
  32768 36864 40960 45056 49152 53248 57344 61440
SW1(config)#spanning-tree vlan 1 priority 24576
SW1(config)#spanning-tree vlan 1 root primary

SW2(config)#spanning-tree vlan 1 priority  28672
SW2(config)#spanning-tree vlan 1 root secondary

Sw3#show spanning-tree
VLAN0001
  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.BA94.6627

Fa0/1            Altn BLK 19        128.1    P2p
Fa0/2            Root FWD 19        128.2    P2p
=====24576--primary  28672--secondary  32768 

SW2#show spanning-tree
VLAN0001
  Bridge ID  Priority    28673  (priority 28672 sys-id-ext 1)
Fa0/1            Root FWD 19        128.1    P2p
Fa0/2            Desg FWD 19        128.2    P2p

SW1#show spanning-tree
VLAN0001
Fa0/2            Desg FWD 19        128.2    P2p
Fa0/1            Desg FWD 19        128.1    P2p

======================================================

SW1(config)#spanning-tree vlan 1 root secondary 
Sw3(config)#spanning-tree vlan 1 root primary

SW1#show spanning-tree 
  Bridge ID  Priority    28673  (priority 28672 sys-id-ext 1)
Fa0/2            Root FWD 19        128.2    P2p
Fa0/1            Altn BLK 19        128.1    P2p

SW2#show spanning-tree
  Bridge ID  Priority    28673  (priority 28672 sys-id-ext 1)
Fa0/1            Desg FWD 19        128.1    P2p
Fa0/2            Root FWD 19        128.2    P2p

Sw3#show spanning-tree
  Bridge ID  Priority    24577  (priority 24576 sys-id-ext 1)


SW2(config)#spanning-tree vlan 1 priority 32768

SW2#show spanning-tree
  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
Fa0/1            Altn BLK 19        128.1    P2p
Fa0/2            Root FWD 19        128.2    P2p

=========================================================
练习3  MS1---vlan1 主要根网桥      MS2---vlan2 主要根网桥
-----------MS1----------------
Switch(config)#hostname MS1
MS1(config)#line console 0
MS1(config-line)#exec-timeout 0 0
MS1(config-line)#logging synchronous
MS1(config)#vlan 2

MS1(config)#interface range fastEthernet 0/1-3
MS1(config-if-range)#switchport trunk encapsulation dot1q
MS1(config-if-range)#switchport mode trunk

MS1#show interfaces fastEthernet 0/2 switchport 
Name: Fa0/2
Switchport: Enabled
Administrative Mode: trunk
MS1#show interfaces fastEthernet 0/1 switchport 
Name: Fa0/1
Switchport: Enabled
Administrative Mode: trunk
Operational Mode: trunk

MS1(config)#spanning-tree vlan 1 root primary 
MS1(config)#spanning-tree vlan 2 root secondary

MS1#show spanning-tree vlan 1
Fa0/3            Desg FWD 19        128.3    P2p
Fa0/2            Desg FWD 19        128.2    P2p
Fa0/1            Desg FWD 19        128.1    P2p

MS1#show spanning-tree vlan 2
Fa0/3            Root FWD 19        128.3    P2p
Fa0/2            Desg FWD 19        128.2    P2p
Fa0/1            Desg FWD 19        128.1    P2p


------------------MS2-----------
Switch(config)#hostname MS2
MS2(config)#line console 0
MS2(config-line)#exec-timeout 0 0
MS2(config-line)#logging synchronous
MS2(config)#vlan 2

MS2(config)#interface range fastEthernet 0/1-3
MS2(config-if-range)#switchport trunk encapsulation dot1q
MS2(config-if-range)#switchport mode trunk

MS2(config)#spanning-tree vlan 2 root primary
MS2(config)#spanning-tree vlan 1 root secondary









-------------------SW1-------------------
SW1(config)#line console 0
SW1(config-line)#exec-timeout 0 0
SW1(config-line)#logging synchronous
SW1(config)#vlan 2

SW1(config)#interface range fastEthernet 0/1-2
SW1(config-if-range)#switchport mode trunk



SW1#show spanning-tree vlan 1
VLAN0001
Fa0/1            Root FWD 19        128.1    P2p
Fa0/2            Altn BLK 19        128.2    P2p

SW1#show spanning-tree vlan 2
Fa0/1            Altn BLK 19        128.1    P2p
Fa0/2            Root FWD 19        128.2    P2p

-----------------------------SW2-------------------------
SW2(config)#line console 0
SW2(config-line)#exec-timeout 0 0
SW2(config-line)#logging synchronous
SW2(config)#vlan 2

SW2(config-vlan)#interface range fastEthernet 0/1-2
SW2(config-if-range)#switchport mode trunk








